def main_menu():
    menu_list = ['Показать все контакты',
                 'Открыть базу телефонной книги',
                 'Найти контакт',
                 'Создать контакт',
                 'Изменить контакт',
                 'Удалить контакт',
                 'Выход'
                 ]
    return menu_list


def search_menu():
    menu_list = ['По фамилии',
                 'По имени',
                 'По телефону',
                 'По комментарию',
                 'Вернуться в главное меню'
                 ]
    return menu_list


def db_menu():
    menu_list = ['database',
                 'recent',
                 'Свой выбор',
                 'Вернуться в главное меню'
                 ]
    return menu_list
